# vim: set ft=ruby

brew 'atuin'
brew 'bash'
brew 'bat'
brew 'coreutils'
brew 'curl'
brew 'difftastic'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go'
brew 'helix'
brew 'helm'
brew 'htop'
brew 'ipcalc'
brew 'istioctl'
brew 'jj'
brew 'jq'
brew 'kubectx'
brew 'lima'
brew 'mkcert'
brew 'moreutils'
brew 'neovim'
brew 'nmap'
brew 'npm'
brew 'openssl'
brew 'pgrep'
brew 'pkill'
brew 'renameutils'
brew 'ripgrep'
brew 'rust'
brew 'rye'
brew 'shellcheck'
brew 'sqlite3'
brew 'starship'
brew 'stern'
brew 'syncthing'
brew 'terraform-ls'
brew 'tfenv'
brew 'tflint'
brew 'tokei'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'yq'
brew 'zoxide'
brew 'zsh'

# See: https://apple.stackexchange.com/questions/431812/how-can-i-stop-a-bluetooth-keyboard-from-waking-my-macbook-pro/437396#437396
brew 'sleepwatcher'
brew 'blueutil'

cask 'rectangle'
cask 'slack'
cask 'beeper'
cask 'spotify'
cask 'vlc'
cask 'monodraw'
cask 'visual-studio-code'
cask 'alfred'
cask 'obsidian'
cask 'numi'

cask 'font-hack-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-roboto-mono-nerd-font'

mas 'Xcode', id: 497799835
mas 'Tailscale', id: 1475387142

