# vim: set ft=ruby

brew 'git'
brew 'zsh'
brew 'bash'
brew 'openssl'
brew 'coreutils'
brew 'gnu-tar'
brew 'fzf'
brew 'ripgrep'
brew 'wget'
brew 'curl'
brew 'gnu-sed'
brew 'jq'
brew 'tree'
brew 'rye'
brew 'starship'
brew 'difftastic'
brew 'zoxide'
brew 'htop'
brew 'fd'
brew 'nmap'
brew 'gh'
brew 'sqlite3'
brew 'moreutils'
brew 'watch'
brew 'shellcheck'
brew 'pgrep'
brew 'pkill'
brew 'neovim'
brew 'atuin'
brew 'lima'
brew 'helix'

# See: https://apple.stackexchange.com/questions/431812/how-can-i-stop-a-bluetooth-keyboard-from-waking-my-macbook-pro/437396#437396
brew 'sleepwatcher'
brew 'blueutil'

cask 'rectangle'
cask 'slack'
cask 'beeper'
cask 'spotify'
cask 'vlc'
cask 'monodraw'
cask 'visual-studio-code'
cask 'alfred'

cask 'font-hack'
cask 'font-jetbrains-mono'
cask 'font-roboto'
cask 'font-roboto-mono'

mas 'Xcode', id: 497799835
mas 'Tailscale', id: 1475387142

